app/views/parks/show.html.erb

SELECT "rangers".* FROM "rangers" INNER JOIN "parks_rangers" ON "rangers"."id" = "parks_rangers"."ranger_id" WHERE "parks_rangers"."park_id" = $1  [["park_id", 1]]
---
	<h2>Rangers on Duty:</h2>
		<% @park.rangers.each do |r| %>