app/views/matters/show.html.erb

SELECT "actions".* FROM "actions" INNER JOIN "actions_matters" ON "actions"."id" = "actions_matters"."action_id" WHERE "actions_matters"."matter_id" = $1  [["matter_id", 1]]
---
	<h2>Activities:</h2>
		<% @matter.actions.each do |r| %>