app/views/rangers/show.html.erb

<div class="container text-center">
	<% if @ranger.parks.length > 0 %>
---
SELECT "parks".* FROM "parks" INNER JOIN "parks_rangers" ON "parks"."id" = "parks_rangers"."park_id" WHERE "parks_rangers"."ranger_id" = $1  [["ranger_id", 1]]