app/controllers/actions_controller.rb

def index
    @actions = Action.all.order(:title)
---
SELECT "actions".* FROM "actions" ORDER BY "actions"."title" ASC