app/controllers/matters_controller.rb

SELECT "matters".* FROM "matters" ORDER BY "matters"."title" ASC
---
def index
  	@matters = Matter.all.order(:title)

SELECT "actions".* FROM "actions" ORDER BY "actions"."title" ASC
---
  def new
  	@matter = Matter.new
  	@actions = Action.all.order(:title)

SELECT  "matters".* FROM "matters" WHERE "matters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@matter = Matter.find(params[:id])

INSERT INTO "matters" ("title", "description", "open", "close", "due", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
  	Matter.create(matter_params)

SELECT  "matters".* FROM "matters" WHERE "matters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "matters" WHERE "matters"."id" = $1  [["id", 1]]
---
  def destroy
  	@matter_to_delete = Matter.find(params[:id])
  	@matter_to_delete.actions.clear