app/controllers/parks_controller.rb

  def index
  	@parks = Park.all.order(:name)
---
SELECT "parks".* FROM "parks" ORDER BY "parks"."name" ASC

  def new
  	@park = Park.new
  	@rangers = Ranger.all.order(:name)
---
SELECT "rangers".* FROM "rangers" ORDER BY "rangers"."name" ASC

  def edit
    @park = Park.find(params[:id])
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
  	@park = Park.find(params[:id])
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
  	Park.create(park_params)
---
INSERT INTO "parks" ("name", "description", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ranier"], ["description", "asd;flkjasdf"], ["picture", ""], ["created_at", "2017-06-08 23:15:22.779627"], ["updated_at", "2017-06-08 23:15:22.779627"]]

  def destroy
  	@park_to_delete = Park.find(params[:id])
  	@park_to_delete.rangers.clear
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "parks" WHERE "parks"."id" = $1  [["id", 4]]

  def update
    Park.find(params[:id]).update(park_params)
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "parks" SET "description" = $1, "updated_at" = $2 WHERE "parks"."id" = $3  [["description", "run, bike and swim"], ["updated_at", "2017-06-14 19:09:32.129890"], ["id", 8]]