app/controllers/rangers_controller.rb

  def index
  	@rangers = Ranger.all.order(:name)
---
SELECT "rangers".* FROM "rangers" ORDER BY "rangers"."name" ASC

  def show
  	@ranger = Ranger.find(params[:id])
---
SELECT  "rangers".* FROM "rangers" WHERE "rangers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
  	@ranger = Ranger.new
  	@parks = Park.all
---
SELECT "parks".* FROM "parks"

  def create
  	Ranger.create(ranger_params)
---
INSERT INTO "rangers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "John"], ["created_at", "2017-06-08 22:24:52.948527"], ["updated_at", "2017-06-08 22:24:52.948527"]]

  def destroy
    @ranger_to_delete = Ranger.find(params[:id])
    @ranger_to_delete.parks.clear
---
SELECT  "rangers".* FROM "rangers" WHERE "rangers"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "rangers" WHERE "rangers"."id" = $1  [["id", 8]]